### More data processing with _pandas_ !

#### Section 3.1

( Merging Dataframes )

In [1]:
# example 1

import pandas as pd

staff = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                      {'Name': 'Sally', 'Role': 'Course liasion'},
                      {'Name': 'James', 'Role': 'Grader'}])

staff_df = staff.set_index('Name')

student = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                        {'Name': 'Mike', 'School': 'Law'},
                        {'Name': 'Sally', 'School': 'Engineering'}])

student_df = student.set_index('Name')

print(staff_df.head())
print(student_df.head())

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader
            School
Name
James     Business
Mike           Law
Sally  Engineering

In [2]:
# Union :

pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

In [3]:
# Intersection :

pd.merge(staff_df, student_df, how='inner', left_index=True, right_index=True)

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader     Business

In [4]:
# Left join :

pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liasion  Engineering
James          Grader     Business

In [5]:
# Right join :

pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liasion  Engineering

In [6]:
# example 2

staff_df = staff_df.reset_index()

student_df = student_df.reset_index()

pd.merge(staff_df, student_df, how='right', on='Name')

    Name            Role       School
0  James          Grader     Business
1   Mike             NaN          Law
2  Sally  Course liasion  Engineering

In [7]:
# example 3

staff = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR',
                       'Location': 'State Street'},
                      {'Name': 'Sally', 'Role': 'Course liasion',
                       'Location': 'Washington Avenue'},
                      {'Name': 'James', 'Role': 'Grader',
                       'Location': 'Washington Avenue'}])

student = pd.DataFrame([{'Name': 'James', 'School': 'Business',
                         'Location': '1024 Billiard Avenue'},
                        {'Name': 'Mike', 'School': 'Law',
                         'Location': 'Fraternity House #22'},
                        {'Name': 'Sally', 'School': 'Engineering',
                         'Location': '512 Wilson Crescent'}])

pd.merge(staff, student, how='left', on='Name')

    Name            Role         Location_x       School            Location_y
0  Kelly  Director of HR       State Street          NaN                   NaN
1  Sally  Course liasion  Washington Avenue  Engineering   512 Wilson Crescent
2  James          Grader  Washington Avenue     Business  1024 Billiard Avenue

#### Section 3.3

( Group by )

We have seen though _Pandas_ allows us to iterate over every row in a dataframe, it is geneally very slow to do so. 

Fortunately _Pandas_ has a _groupby()_ function to speed up such task.

**Aggregation** :

The most straight forward apply step is the aggregation of data, and uses the method _agg()_ on the groupby object. 

With agg we can pass in a dictionary of the columns we are interested in aggregating along with the function we are looking to apply to aggregate.

**Transformation** :

Transformation is different from aggregation. 

Where _agg()_ returns a single value per column, so one row per group, transformation() returns an object that is the same size as the group.

**Filtering** :

The _filter()_ function takes in a function which it applies to each group dataframe and returns either a True or a False, depending upon whether that group should be included in the results.

#### Section 3.6

( Date/Time Functionality )

##### Timestamp

In [10]:
pd.Timestamp('9/1/2019 10:05AM')

Timestamp('2019-09-01 10:05:00')

In [12]:
pd.Timestamp(2019, 12, 20, 0, 0)

Timestamp('2019-12-20 00:00:00')

In [13]:
pd.Timestamp(2019, 12, 20, 0, 0).isoweekday()

5

In [14]:
pd.Timestamp(2019, 12, 20, 5, 2, 23).second

23

##### Period

In [15]:
pd.Period('1/2016')

Period('2016-01', 'M')

In [16]:
pd.Period('3/5/2016')

Period('2016-03-05', 'D')

In [17]:
pd.Period('1/2016') + 5

Period('2016-06', 'M')

In [18]:
pd.Period('3/5/2016') - 2

Period('2016-03-03', 'D')

##### DatetimeIndex and PeriodIndex

In [19]:
t1 = pd.Series(list('abc'), [pd.Timestamp('2016-09-01'), 
                             pd.Timestamp('2016-09-02'),
                             pd.Timestamp('2016-09-03')])

t1

2016-09-01    a
2016-09-02    b
2016-09-03    c
dtype: object

In [20]:
type(t1.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [21]:
t2 = pd.Series(list('def'), [pd.Period('2016-09'),
                             pd.Period('2016-10'),
                             pd.Period('2016-11')])

t2

2016-09    d
2016-10    e
2016-11    f
Freq: M, dtype: object

In [22]:
type(t2.index)

pandas.core.indexes.period.PeriodIndex

##### Converting to DateTime

In [39]:
import numpy as np

d1 = ['2 June 2013', 'Aug 29 2014', '2015-06-26', '7/12/16']

ts3 = pd.DataFrame(np.random.randint(10, 100, (4,2)), index=d1, columns=list('ab'))

ts3

              a   b
2 June 2013  56  90
Aug 29 2014  62  44
2015-06-26   49  61
7/12/16      71  14

In [42]:
ts3.index = pd.to_datetime(ts3.index)

ts3

             a   b
2013-06-02  56  90
2014-08-29  62  44
2015-06-26  49  61
2016-07-12  71  14

##### Timedelta

In [43]:
pd.Timestamp('9/3/2016') - pd.Timestamp('9/1/2016')

Timedelta('2 days 00:00:00')

In [44]:
pd.Timestamp('9/2/2016 8:10AM') + pd.Timedelta('12D 3H')

Timestamp('2016-09-14 11:10:00')

##### Offset

Offset is similar to timedelta, but it follows specific calendar duration rules.

In [45]:
pd.Timestamp('9/4/2016').weekday()

6

In [46]:
pd.Timestamp('9/4/2016') + pd.offsets.Week()

Timestamp('2016-09-11 00:00:00')

##### Working with Dates in a Dataframe

In [50]:
dates = pd.date_range('10-01-2016', periods=9, freq='2W-SUN')

dates

DatetimeIndex(['2016-10-02', '2016-10-16', '2016-10-30', '2016-11-13',
               '2016-11-27', '2016-12-11', '2016-12-25', '2017-01-08',
               '2017-01-22'],
              dtype='datetime64[ns]', freq='2W-SUN')

In [56]:
dates = pd.date_range('10-01-2016', periods=9, freq='B')

dates

DatetimeIndex(['2016-10-03', '2016-10-04', '2016-10-05', '2016-10-06',
               '2016-10-07', '2016-10-10', '2016-10-11', '2016-10-12',
               '2016-10-13'],
              dtype='datetime64[ns]', freq='B')

In [64]:
dates = pd.date_range('10-01-2016', periods=9, freq='2W-SUN')

df = pd.DataFrame({'Count 1': 100 + np.random.randint(-5, 10, 9).cumsum(),
                   'Count 2': 120 + np.random.randint(-5, 10, 9)}, index=dates)

df

            Count 1  Count 2
2016-10-02      101      116
2016-10-16      110      115
2016-10-30      111      127
2016-11-13      114      123
2016-11-27      118      123
2016-12-11      114      123
2016-12-25      123      119
2017-01-08      126      126
2017-01-22      124      118

In [73]:
df.index.day_of_week

Int64Index([6, 6, 6, 6, 6, 6, 6, 6, 6], dtype='int64')

In [76]:
df.diff()

            Count 1  Count 2
2016-10-02      NaN      NaN
2016-10-16      9.0     -1.0
2016-10-30      1.0     12.0
2016-11-13      3.0     -4.0
2016-11-27      4.0      0.0
2016-12-11     -4.0      0.0
2016-12-25      9.0     -4.0
2017-01-08      3.0      7.0
2017-01-22     -2.0     -8.0

In [90]:
# indexing and slicing :

df['2017']

C:\Users\Latitude 7270\AppData\Local\Temp\ipykernel_4240\3427032329.py:3: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  df['2017']

            Count 1  Count 2
2017-01-08      126      126
2017-01-22      124      118